export type BehaviorType = "吉" | "凶" | "平";

export type Palace = "乾六宮" | "兌七宮" | "離九宮" | "震三宮" | "巽四宮" | "坎一宮" | "艮八宮" | "坤二宮";

export type God = "值符" | "螣蛇" | "太陰" | "六合" | "白虎" | "玄武" | "九地" | "九天";

export type Star = "天蓬" | "天芮" | "天冲" | "天輔" | "天禽" | "天心" | "天柱" | "天任" | "天英";

export type Door = "休門" | "死門" | "傷門" | "杜門" | "開門" | "驚門" | "生門" | "景門";

export type HeavenlyStem = "乙" | "丙" | "丁" | "戊" | "己" | "庚" | "辛" | "壬" | "癸";

export type QMPattern = "青龍和會" | "青龍返首" | "青龍耀明" | "青龍伏吟" | "貴人入獄" | "值符飛宮" | "青龍折足" | "青龍入水" | "青龍華蓋";
